[V11.0]
1=<a>Brandneuer Software Health</a> hilft beim Verwalten von Softwareberechtigungen, Blockieren von Popup-Benachrichtigungen, Bereinigen nicht benötigter Setup-Dateien und Entfernen schädlicher Software und Browsererweiterungen
2=<a>Leistungsfähigere Deinstallations-Engine</a> entfernt restliche Dateien vollständig mit fortschrittlichen Scan- und Reinigungsalgorithmen
3=<a>Verbesserter Install Monitor</a> kann weitere Elemente (einschließlich PC-Starts) protokollieren, die während des Installationsprozesses für eine zukünftige gründliche Deinstallation erstellt wurden
4=<a>50% größere Datenbank</a> unterstützt die Aktualisierung bekannterer Software, einschließlich AnyDesk, Calibre, Discord, LibreOffice und qBittorrent
5=<a>Datenbank zum Entfernen hartnäckiger Programme</a> unterstützt das Entfernen von mehr als 1000 hartnäckigen Programmen
6=<a>Zwang-Deinstallation</a> kann Programme problemlos deinstallieren, wenn Deinstallationsregistrierungen fehlen
7=<a>Neu hinzugefügte Windows Apps-Bewertung</a> hilft dabei, mehr über das Entfernen unerwünschter Windows-Apps zu erfahren
8=<a>Verbesserter Entfernungsprozess</a> von Browsererweiterungen
9=<a>Bessere Benutzeroberfläche</a> für eine benutzerfreundlichere Erfahrung
10=<a>Zwei Skins:</a> dunkel und hell
11=<a>37 Sprachen unterstützt</a>
12=<a>Unterstützt Windows 11 vollständig</a>